[
  {
    "id": "1",
    "createdAt": "2026-02-27T04:13:38.257Z",
    "videoUrl": "https://www.tiktok.com/@twaydabae/video/7330374954220834090?is_from_webapp=1&sender_device=pc&web_id=7605420748937889281",
    "transcript": "This is hot honey pork belly. We add some peppercorns, some bay leaves. While we wait for the pork belly to poach, we're gonna make our hot honey. Half a cup of hot honey and a fourth cup of rice vinegar. This is heated up to 400. Let it crisp up. So after 10 minutes, I'm taking the first fry out, and then I'm bringing the heat up to 450. And take this hot honey and brush it right onto the pork belly. Sweet with a crunch. Perfect.",
    "vocabulary": "pork belly, peppercorns, bay leaves, poach, is heated up to, crisp up, bring the heat up to, brush onto",
    "grammarStructures": "While we wait for...we're gonna...; I'm V-ing",
    "recordings": "https://res.cloudinary.com/dndwvsqib/video/upload/v1750342960/1-1_kv1ko3.mp3"
  },
  {
    "id": "2",
    "createdAt": "2026-02-27T15:53:32.470Z",
    "videoUrl": "https://www.tiktok.com/@selina.dasilvaaa/video/7477710114661600534?is_from_webapp=1&sender_device=pc&web_id=7605420748937889281",
    "transcript": "Let’s make a skin beauty water. We’re going to start by adding warm water. Next thing we’re going to add is goji berries. Then we’re going to add half of a lemon which contains lots of vitamin C. And you really want to get everything out of your lemon so that your skin beauty water contains lots of vitamin C. Last thing we’re going to add is one kiwi, plus the peel of the kiwi, which is also packed with vitamin C. After adding the three ingredients, we’re going to mix everything together, so that it can really spread in the water. The most important part is to not only drink the water but also to eat everything that’s inside of the water.",
    "vocabulary": "goji berries: kỷ tử, is also packed with, spread in the water, get everything out of your lemon",
    "grammarStructures": "The most important part is to not only drink the water but also to eat everything that’s inside of the water.; to not only V but also to V",
    "recordings": ""
  }
]
